feat: adds models. Closes #2
